export const facets = {
  class: {
    label: "ชั้นหนี้",
    groups: {
      1: {
        label: "SM",
      },
      2: {
        label: "NPL",
      },
    },
  },
  product: {
    label: "ประเภทสินเชื่อ",
    groups: {
      0: {
        label: "ทุกประเภท",
      },
      1: {
        label: "บัตรเครดิต",
      },
      2: {
        label: "สินเชื่อไม่มีหลักประกันอื่น ๆ",
      },
      3: {
        label: "อสังหาริมทรัพย์",
      },
      4: {
        label: "เช่าซื้อรถ",
      },
      5: {
        label: "สินเชื่อธุรกิจ",
      },
      6: {
        label: "รถจักรยานยนต์",
      },
      7: {
        label: "เพื่อการเกษตร",
      },
      9: {
        label: "มากกว่าหนึ่งประเภท",
      },
    },
  },
  age: {
    label: "ช่วงอายุ",
    groups: {
      1: {
        label: "20–25",
      },
      2: {
        label: "26–35",
      },
      3: {
        label: "36–45",
      },
      4: {
        label: "46–60",
      },
      5: {
        label: "61–85",
      },
      99: {
        label: "ไม่ระบุ",
      },
    },
  },
  fi: {
    label: "ประเภทสถาบันการเงิน",
    groups: {
      0: {
        label: "ทุกสถาบันการเงิน",
      },
      1: {
        label: "ธนาคารพาณิชย์",
      },
      2: {
        label: "Non-bank",
      },
      3: {
        label: "SFI",
      },
      4: {
        label: "อื่น ๆ",
      },
      9: {
        label: "มากกว่าหนึ่งสถาบันการเงิน",
      },
    },
  },
  region: {
    label: "ภูมิภาค",
    groups: {
      1: {
        label: "กรุงเทพฯ",
      },
      2: {
        label: "ภาคกลาง",
      },
      3: {
        label: "ภาคเหนือ",
      },
      4: {
        label: "ภาคตะวันออกเฉียงเหนือ",
      },
      5: {
        label: "ภาคใต้",
      },
      99: {
        label: "ไม่ระบุ",
      },
    },
  },
  urban: {
    label: "ใน/นอกเขตเมือง",
    groups: {
      1: {
        label: "นอกเขตเทศเทศบาล",
      },
      2: {
        label: "ในเขตเทศบาล",
      },
      99: {
        label: "ไม่ระบุ",
      },
    },
  },
  covid: {
    label: "กู้ก่อน/หลังโควิด",
    groups: {
      1: {
        label: "เป็นผู้กู้ก่อนโควิด",
      },
      2: {
        label: "เป็นผู้กู้หลังโควิด",
      },
    },
  },
}